# encoding: UTF-8
# Question#is_mandatory is now false by default. The default_mandatory option allows you to set
#   is_mandatory for all questions in a survey.

survey "HAPPINOMETER" do

  section "1 : ข้อมูลหน่วยงาน" do
    group "รายละเอียด" do
      q_0101 "ชื่อองค์กร/หน่วยงาน/สถานประกอบการ"
      a :string

      q_0102 "ภาค", :pick => :one, :display_type => :dropdown
      a_1 "ภาคเหนือ"
      a_2 "ภาคตะวันออกเฉียงเหนือ"
      a_3 "ภาคกลาง"
      a_4 "ภาคตะวันออก"
      a_5 "ภาคตะวันตก"
      a_6 "ภาคใต้"

      q_0102a "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_1
      a "จังหวัดเชียงราย "
      a "จังหวัดเชียงใหม่ "
      a "จังหวัดน่าน "
      a "จังหวัดพะเยา "
      a "จังหวัดแพร่ "
      a "จังหวัดแม่ฮ่องสอน "
      a "จังหวัดลำปาง "
      a "จังหวัดลำพูน "
      a "จังหวัดอุตรดิตถ์ "

      q_0102b "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_2
      a "จังหวัดกาฬสินธุ์ "
      a "จังหวัดขอนแก่น "
      a "จังหวัดชัยภูมิ "
      a "จังหวัดนครพนม "
      a "จังหวัดนครราชสีมา "
      a "จังหวัดบึงกาฬ "
      a "จังหวัดบุรีรัมย์ "
      a "จังหวัดมหาสารคาม "
      a "จังหวัดมุกดาหาร "
      a "จังหวัดยโสธร "
      a "จังหวัดร้อยเอ็ด "
      a "จังหวัดเลย "
      a "จังหวัดสกลนคร "
      a "จังหวัดสุรินทร์ "
      a "จังหวัดศรีสะเกษ "
      a "จังหวัดหนองคาย "
      a "จังหวัดหนองบัวลำภู "
      a "จังหวัดอุดรธานี "
      a "จังหวัดอุบลราชธานี "
      a "จังหวัดอำนาจเจริญ "

      q_0102c "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_3
      a "กรุงเทพมหานคร"
      a "จังหวัดกำแพงเพชร "
      a "จังหวัดชัยนาท "
      a "จังหวัดนครนายก "
      a "จังหวัดนครปฐม "
      a "จังหวัดนครสวรรค์ "
      a "จังหวัดนนทบุรี "
      a "จังหวัดปทุมธานี "
      a "จังหวัดพระนครศรีอยุธยา "
      a "จังหวัดพิจิตร "
      a "จังหวัดพิษณุโลก "
      a "จังหวัดเพชรบูรณ์ "
      a "จังหวัดลพบุรี "
      a "จังหวัดสมุทรปราการ "
      a "จังหวัดสมุทรสงคราม "
      a "จังหวัดสมุทรสาคร "
      a "จังหวัดสิงห์บุรี "
      a "จังหวัดสุโขทัย "
      a "จังหวัดสุพรรณบุรี "
      a "จังหวัดสระบุรี "
      a "จังหวัดอ่างทอง "
      a "จังหวัดอุทัยธานี "

      q_0102d "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_4
      a "จังหวัดจันทบุรี "
      a "จังหวัดฉะเชิงเทรา "
      a "จังหวัดชลบุรี "
      a "จังหวัดตราด "
      a "จังหวัดปราจีนบุรี "
      a "จังหวัดระยอง "
      a "จังหวัดสระแก้ว "

      q_0102e "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_5
      a "จังหวัดกาญจนบุรี "
      a "จังหวัดตาก "
      a "จังหวัดประจวบคีรีขันธ์ "
      a "จังหวัดเพชรบุรี "
      a "จังหวัดราชบุรี "

      q_0102f "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_6
      a "จังหวัดกระบี่ "
      a "จังหวัดชุมพร "
      a "จังหวัดตรัง "
      a "จังหวัดนครศรีธรรมราช "
      a "จังหวัดนราธิวาส "
      a "จังหวัดปัตตานี "
      a "จังหวัดพังงา "
      a "จังหวัดพัทลุง "
      a "จังหวัดภูเก็ต "
      a "จังหวัดระนอง "
      a "จังหวัดสตูล "
      a "จังหวัดสงขลา "
      a "จังหวัดสุราษฎร์ธานี "
      a "จังหวัดยะลา "

      q_0104 "อำเภอ/เขต"
      a  :string

      q_0105 "ตำบล/แขวง"
      a :string

    end

    q_0106 "ประเภทหน่วยงาน/องค์กร", :pick => :one, :display_type => :dropdown
    a_1 "หน่วยงานภาครัฐ  สังกัด  กรม / กระทรวง"
    a_2 "หน่วยงานรัฐวิสาหกิจ"
    a_3 "หน่วยงานเอกชน"
    a_4 "สถาบันการศึกษา"
    a_5 "องค์กรพัฒนาเอกชน (NGO)"
    a_6 "องค์กรระหว่างประเทศ"
    a_7 "อื่นๆ (ระบุ)"

    q_0106a "ระบุ"
    a_1 "กระทรวง", :string, :custom_class => "my_string" 
    a_2 "กรม", :string, :custom_class => "my_string"
    dependency :rule => "A"    
    condition_A :q_0106, "==", :a_1

    q_0106b "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0106, "==", :a_7

    q_0107 "หน่วยงาน/องค์กร ของท่านมีขนาดใด", :pick => :one, :display_type => :dropdown
    a_1 "ขนาดเล็กมาก (1-20 คน)"
    a_2 "ขนาดเล็ก (21-50 คน)"
    a_3 "ขนาดกลาง (51-200 คน)"
    a_4 "ขนาดใหญ่ (201-500 คน)"
    a_5 "ขนาดใหญ่มาก (501-1,000 คน)"
    a_6 "ขนาดใหญ่มากที่สุด (1,001 คนขึ้นไป)"

    q_0108 "หน่วยงานที่ท่านทำงานอยู่เป็นลักษณะใด", :pick => :one, :display_type => :dropdown
    a_1 "สำนักงานใหญ่" 					
    a_2 "สาขา/กรม/กอง"
    a_3 "ไซต์งาน"
    a_4 "อื่นๆ (ระบุ)"

    q_0108a "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0108, "==", :a_4

  end

  section "2 : ข้อมูลทั่วไป" do
    q_0201 "เพศ",:pick => :one, :display_type => :inline
    a "ชาย"
    a "หญิง"
    a "เพศทางเลือก"

    q_0202 "อายุ"
    a "|ปี", :integer

    q_0203 "จังหวัดที่ท่านอาศัยอยู่ในปัจจุบันเป็นจังหวัดเดียวกับภูมิลำเนาหรือไม่", :pick => :one, :display_type => :inline
    a "ใช่"
    a "ไม่ใช่"

    q_0204 "ท่านจบการศึกษาสูงสุด ในระดับใด (ไม่รวมระดับการศึกษาที่ยังไม่สำเร็จการศึกษา)", :pick => :one, :display_type => :dropdown
    a_1 "ประถมศึกษาหรือต่ำกว่า"
    a_2 "มัธยมศึกษาตอนต้น"
    a_3 "มัธยมศึกษาตอนปลาย"
    a_4 "ปวช"
    a_5 "ปวส"
    a_6 "อนุปริญญาหรือเทียบเท่า"
    a_7 "ปริญญาตรี"
    a_8 "สูงกว่าปริญญาตรี"
    a_9 "ไม่ได้รับการศึกษา"
    a_10 "อื่นๆ (ระบุ)"

    q_0204a "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0204, "==", :a_10

    q_0205 "สถานภาพสมรส", :pick => :one, :display_type => :dropdown
    a_1 "โสด"
    a_2 "แต่งงานและอยู่ร่วมกัน"
    a_3 "แต่งงานแต่ไม่ได้อยู่ด้วยกัน"
    a_4 "อยู่ด้วยกันโดยไม่ได้แต่งงาน"
    a_5 "หม้าย"
    a_6 "หย่า/แยกทาง/เลิกกัน"

    q_0206 "ท่านมีบุตรหรือไม่ (รวมลูกบุญธรรม/ลูกติด/ลูกเลี้ยง)", :pick => :one, :display_type => :dropdown
    a_1 "ไม่มี"
    a_2 "มี จำนวน 1 คน"
    a_3 "มี จำนวน 2 คน"
    a_4 "มี จำนวน 3-4 คน"
    a_5 "มี จำนวนตั้งแต่ 5 คนขึ้นไป"

    q_0207 "ขณะนี้ท่านกำลังตั้งครรภ์หรือไม่ (ถามเฉพาะเพศหญิง)", :pick => :one
    a_1 "ตั้งครรภ์"
    a_2 "ไม่ได้ตั้งครรภ์"

    q_0208 "งานที่ท่านทำเป็นงานลักษณะใด", :pick => :one, :display_type => :dropdown
    a_1 "งานสำนักงาน"
    a_2 "งานด้านการผลิต"
    a_3 "งานด้านการบริการ"
    a_4 "งานด้านบริหาร"
    a_5 "งานด้านอื่นๆ (ระบุ)"

    q_0208a "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0208, "==", :a_5
 
    q_0209 "ท่านปฏิบัติงานในระดับตำแหน่งใด", :pick => :one, :display_type => :dropdown
    a_1 "ระดับปฏิบัติงาน"
    a_2 "ระดับหัวหน้างาน"
    a_3 "ระดับผู้บริหารองค์กร"
    a_4 "อื่นๆ (ระบุ)"

    q_0209a "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0209, "==", :a_4

    q_0210 "สถานภาพการจ้างงาน", :pick => :one, :display_type => :dropdown
    a_1 "ประจำ"
    a_2 "ตามสัญญาจ้าง"
    a_3 "รายวัน"
    a_4 "บางช่วงเวลา"
    a_5 "ตามผลงาน"
    a_6 "จ้างเหมา"

    q_0211 "ท่านทำงานเป็นกะ/ทำงานเป็นรอบ/เข้าเวรใช่หรือไม่", :pick => :one
    a_1 "ไม่ใช่"
    a_2 "ทำงานเป็นกะ/เข้าเวร"

    q_0212 "ระยะเวลาที่ท่านทำงานในองค์กรปัจจุบัน รวมทั้งหมด", :pick => :one
    a_1 "ไม่ถึงปี"
    a_2 "ระหว่าง 1-2 ปี"
    a_3 "ระหว่าง 3-5 ปี"
    a_4 "ระหว่าง 6-9 ปี"

    q_0213 "ตั้งแต่เริ่มทำงานจนถึงปัจจุบัน ท่านลาออก/ย้าย/เปลี่ยนงานมาแล้วกี่ครั้ง", :pick => :one
    a_1 "ไม่เคยลาออกย้ายเปลี่ยนงาน"
    a_2 "1-3 ครั้ง"
    a_3 "4-6 ครั้ง"
    a_4 "7-9 ครั้ง"
    a_5 "10 ครั้งขึ้นไป"

    q_0214 "ท่านมีรายได้ต่อเดือน โดยประมาณเดือนละเท่าใด (รายได้+เงินเดือน+ค่าตอบแทนอื่นๆ)", :pick => :one
    a_1 "น้อยกว่า 10,000 บาท"
    a_2 "10,001-20,000 บาท"
    a_3 "20,001-30,000 บาท"
    a_4 "30,001-40,000 บาท"
    a_5 "40,001-50,000 บาท"
    a_6 "50,001-100,000 บาท"
    a_7 "มากกว่า 100,000 บาท"

  end

  section "3 : Happinometer" do
  label "Happy Body / สุขภาพกายดี"

    group "ปัจจุบันท่าน", :display_type => :inline do
      q_03011 "น้ำหนัก"
      a "|กิโลกรัม", :integer

      q_03012 "ส่วนสูง"
      a "|เซนติเมตร", :integer

      q_03013 "เส้นรอบเอว"
      a "|นิ้ว", :integer
    end

    q_0302 "โดยปกติท่านกินอาหารเช้า โดยเฉลี่ยสัปดาห์ละกี่วัน", :pick => :one
    a_1 "ไม่กิน"
    a_2 "กินแต่ไม่บ่อย (1-2 วัน)"
    a_3 "กินเป็นบางครั้ง (3-4 วัน)"
    a_4 "กินเป็นประจำ (5-6 วัน)"
    a_5 "กินทุกวัน"

    q_0303 "ปัจจุบันท่านออกำลังกายโดยเฉลี่ยสัปดาห์ละกี่วัน", :pick => :one
    a_1 "ไม่ได้ออกกำลังกาย"
    a_2 "น้อยกว่า 3 วันต่อสัปดาห์"
    a_3 "จำนวน 3 วันต่อสัปดาห์"
    a_4 "มากกว่า 3 วันต่อสัปดาห์"
    a_5 "ทุกวัน"

    q_0304 "ปัจจุบันท่านสูบบุหรี่/ใบจาก/ยาเส้น หรือไม่", :pick => :one
    a_1 "สูบเป็นประจำ"
    a_2 "สูบบ่อยครั้ง"
    a_3 "สูบนานๆ ครั้ง"
    a_4 "ไม่สูบแต่เคยสูบ"
    a_5 "ไม่เคยดื่มเลย"

    q_0305 "ปัจจุบันท่านดื่มเครื่องดื่มแอลกอฮอล์ เช่น เหล้า เบียร์ ไวน์ สาโท หรือสุราพื้นบ้านหรือไม่", :pick => :one
    a_1 "ดื่มเกือบทุกวัน/เกือบทุกสัปดาห์"
    a_2 "ดื่มเกือบทุกเดือน"
    a_3 "ดื่มปีละ 1-2 ครั้ง"
    a_4 "ไม่ดื่มแต่เคยดื่ม"
    a_5 "ไม่เคยดื่มเลย"

    q_0306 "โดยรวมแล้วท่านพึงพอใจกับสุขภาพกายของท่านหรือไม่", :pick => :one
    a_1 "ไม่พอใจเลย/พอใจน้อยที่สุด"
    a_2 "พอใจน้อย"
    a_3 "พอใจปานกลาง"
    a_4 "พอใจมาก"
    a_5 "พอใจมากที่สุด"

    q_0307 "โดยรวมแล้วท่านรู้สึกว่าได้รับการพักผ่อนเพียงพอหรือไม่", :pick => :one
    a_1 "ไม่พอ/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0308 "โดยรวมแล้วใน 1 สัปดาห์ท่านทำกิจกรรมเพื่อเป็นการพักผ่อนหย่อยใจ (อ่านหนังสือ ดูหนัง ฟังเพลง ซ็อปปิ้ง เล่นเกมส์ ปลูกต้นไม้ ฯลฯ) หรือไม่", :pick => :one
    a_1 "ไม่ได้ทำ/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0309 "โดยรวมแล้วท่านมีความเครียด (เครียดจากการทำงาน/เรื่องครอบครัว/เรื่องอื่นๆ) บ้างหรือไม่", :pick => :one
    a_1 "เครียดมากที่สุด"
    a_2 "เครียดมาก"
    a_3 "เครียดปานกลาง"
    a_4 "เครียดน้อย	"
    a_5 "ไม่เครียดเลย"

    q_0310 "โดยรวมแล้วท่านคิดว่าชีวิตของท่านเป็นไปตามที่ท่านคาดหวัง หรือไม่", :pick => :one
    a_1 "ไม่เป็นไปตามที่คาดหวังเลย"
    a_2 "เป็นไปตามที่คาดหวังเล็กน้อย"
    a_3 "เป็นไปตามที่คาดหวังปานกลาง"
    a_4 "เป็นไปตามที่คาดหวังมาก"
    a_5 "เป็นไปตามที่คาดหวังมากที่สุด"

    q_0311 "เมื่อประสบปัญหาในชีวิต โดยทั่วไปท่านสามารถจัดการกับปัญหาได้หรือไม่", :pick => :one
    a_1 "ไม่สามารถจัดการได้เลย"
    a_2 "จัดการได้น้อยมาก"
    a_3 "จัดการได้ปานกลาง"
    a_4 "จัดการได้มาก"
    a_5 "จัดการได้มากที่สุด"

  label "Happy Heart / น้ำใจดี"

    q_0312 "โดยรวมแล้ว ท่านรู้สึกเอื้ออาทร/ห่วงใยต่อคนรอบข้างหรือไม่", :pick => :one
    a_1 "ไม่รู้สึกเลย/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0313 "โดยรวมแล้ว ท่านให้การช่วยเหลือแก่คนรอบข้างหรือไม่", :pick => :one
    a_1 "ไม่เคย/แทบจะไม่เคยช่วย"
    a_2 "นานๆ ครั้ง"
    a_3 "ช่วยบ้างบางครั้ง"
    a_4 "ช่วยแทบทุกครั้ง"
    a_5 "ช่วยทุกครั้ง"

    q_0314 "โดยรวมแล้วท่านเต็มใจและยินดี ในการทำประโยชน์เพื่อส่วนรวม หรือไม่", :pick => :one
    a_1 "ไม่เต็มใจ/เต็มใจน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0315 "โดยรวมแล้วท่านเข้าร่วมกิจกรรมที่เป็นประโยชน์ต่อสังคม เช่น การปลูกป่าการบริจาคสิ่งของ หรือไม่", :pick => :one
    a_1 "ไม่เข้าร่วม/เข้าร่วมน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0316 "โดยรวมแล้วท่านได้ทำกิจกรรมที่สามารถทำได้ด้วยตนเองและมีประโยชน์ต่อสังคม เช่น การคัดแยกขยะ การลดใช้ถุงพลาสติก เป็นต้น", :pick => :one
    a_1 "ไม่ทำ/ทำน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0317 "โดยรวมแล้วท่านทำนุบำรุงศิลปวัฒนธรรม/ศาสนา/การให้ทาน หรือไม่", :pick => :one
    a_1 "ไม่ทำ/ทำน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0318 "โดยรวมแล้ว ท่านปฏิบัติกิจตามศาสนาเพื่อให้จิตใจสงบหรือไม่", :pick => :one
    a_1 "ไม่ปฏิบัติ/ปฏิบัติน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0319 "โดยรวมแล้ว ท่านยกโทษและให้อภัยอย่างจริงใจต่อผู้ที่สำนักผิด", :pick => :one
    a_1 "ไม่ยอมรับ/ขอโทษน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0320 "โดยรวมแล้ว ท่านยอมรับและขอโทษในความผิดที่ทำหรือมีส่วนรับผิดชอบ", :pick => :one
    a_1 "ไม่ยอมรับ/ขอโทษน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0321 "โดยรวมแล้ว ท่านตอบแทนผู้มีพระคุณ หรือช่วยเหลือท่าน", :pick => :one
    a_1 "ไม่ตอบแทน/ตอบแทนน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

  label "Happy Family / ครอบครัวดี"

    q_0322 "ท่านมีเวลาอยู่กับครอบครัว เพียงพอหรือไม่", :pick => :one
    a_1 "ไม่เพียงพอ"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0323 "ท่าน ทำกิจกรรม (ออกกำลังกาย ทำบุญ ซื้อของ ฯลฯ) ร่วมกันกับคนในครอบครัว", :pick => :one
    a_1 "ไม่ทำ/ทำน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0324 "โดยรวมแล้วท่านมีความสุขกับครอบครัวของท่านหรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

  label "Happy Society / สังคมดี"

    q_0325 "โดยรวมแล้ว เพื่อนบ้าน มีความสัมพันธ์ที่ดีต่อท่านหรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0326 "โดยรวมแล้วท่านปฏิบัติตามกฎระเบียบ/ข้อบังคับของสังคม หรือไม่", :pick => :one
    a_1 "ไม่ปฏิบัติ/ปฏิบัติน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0327 "โดยรวมแล้วท่านรู้สึก ปลอดภัยในชีวิตและทรัพย์สิน หรือไม่", :pick => :one
    a_1 "ไม่รู้สึก/ปฏิบัติน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0328 "โดยรวมแล้ว เมื่อท่านมีปัญหา ท่านสามารถขอความช่วยเหลือจากคนในชุมชนหรือไม่", :pick => :one
    a_1 "ไม่ได้/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0329 "โดยรวมแล้ว ท่านรู้สึกว่า สังคมไทยทุกวันนี้ มีความสงบสุข หรือไม่", :pick => :one
    a_1 "ไม่ได้/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0330 "โดยรวมแล้วทุกวันนี้ท่านใช้ชีวิตในสังคมอย่างมีความสุข หรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

  label "Happy Brain / ใฝ่รู้ดี"

    q_0331 "โดยรวมแล้วท่านสนใจในการแสวงหาความรู้ใหม่ๆ เพิ่มเติมจากแหล่งความรู้ต่างๆ หรือไม่", :pick => :one
    a_1 "ไม่สนใจ/สนใจน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0332 "โดยรวมแล้ว ท่านสนใจที่จะพัฒนาตนเอง เพื่อความก้าวหน้าในชีวิตหรือไม่", :pick => :one
    a_1 "ไม่สนใจ/สนใจน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0333 "ท่านมีโอกาสที่จะได้รับการอบรม/ศึกษาต่อ/ดูงาน เพื่อพัฒนาทักษะและความสามารถของตนเองหรือไม่", :pick => :one
    a_1 "ไม่มีโอกาส/มีโอกาสน้อยที่สุด"
    a_2 "มีโอกาสน้อย"
    a_3 "มีโอกาสปานกลาง"
    a_4 "มีโอกาสมาก"
    a_5 "มีโอกาสมากที่สุด"

  label "Happy Money / สุขภาพเงินดี"

    q_0334 "ท่านรู้สึกว่า การผ่อนชำระหนี้สินต่างๆ โดยรวมของท่านในปัจจุบันเป็นภาระ หรือไม่", :pick => :one
    a_1 "เป็นภาระหนักที่สุด"
    a_2 "เป็นภาระหนักมาก"
    a_3 "เป็นภาระปานกลาง"
    a_4 "เป็นภาระน้อย"
    a_5 "ไม่เป็นภาระ/ไม่ได้ผ่อนชำระ/ไม่มีหนี้สิน"

    q_0335 "ท่านผ่อนชำระหนี้ตามกำหนดเวลาทุกครั้งหรือไม่", :pick => :one
    a_1 "ไม่ตรงเวลาทุกครั้ง"
    a_2 "ไม่ตรงเวลาบ่อยครั้ง"
    a_3 "ตรงเวลาบ้างบางครั้ง"
    a_4 "ตรงเวลาเกือบทุกครั้ง"
    a_5 "ตรงเวลาทุกครั้ง/ไม่ได้ผ่อนชำระ/ไม่มีหนี้สิน"

    q_0336 "โดยรวมแล้ว ท่านมีเงินเก็บออมในแต่ละเดือนหรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "มี/เก็บออมเพียงเล็กน้อย"
    a_3 "มี/เก็บออมปานกลาง"
    a_4 "มี/เก็บออมมาก"
    a_5 "มี/เก็บออมมากที่สุด"

    q_0337 "โดยรวมแล้ว ค่าตอบแทนที่ท่านได้รับทั้งหมดในแต่ละเดือนเป็นอย่างไร เมื่อเปรียบเทียบกับรายจ่ายทั้งหมดในแต่ละเดือน", :pick => :one
    a_1 "รายจ่ายเกินกว่ารายได้มาก"
    a_2 "รายจ่ายเกินกว่าเล็กน้อย"
    a_3 "รายจ่ายพอๆ"
    a_4 "รายจ่ายน้อยกว่ารายได้"
    a_5 "รายจ่ายน้อยกว่ารายได้มาก"

  label "Happy Work Life (Happy Plus) / การงานดี"

    q_0338 "งานของท่าน มีความท้าทายและส่งเสริมให้ท่านได้เรียนรู้สิ่งใหม่ๆ หรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0339 "งานของท่าน มีความชัดเจนของโอกาสในการเติมโตในตำแหน่ง หน้าที่หรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0340 "งานของท่านในขณะนี้มีความมั่นคง หรือไม่", :pick => :one
    a_1 "ไม่มั่นคง/มั่นคงน้อยที่สุด"
    a_2 "มั่นคงน้อย"
    a_3 "มั่นคงปานกลาง"
    a_4 "มั่นคงยาก"
    a_5 "มั่นคงมากที่สุด"

    q_0341 "ในการทำงาน ท่านสามารถแสดงความคิดเห็นและมีส่วนร่วมในข้อเสนอแนะกับนายจ้าง หรือหัวหน้างาน หรือไม่", :pick => :one
    a_1 "ไม่มีส่วนร่วม/มีน้อยที่สุด"
    a_2 "มีส่วนร่วมบ้างเล็กน้อย"
    a_3 "มีส่วนร่วมปานกลาง"
    a_4 "มีส่วนร่วมมาก"
    a_5 "มีส่วนร่วมมากที่สุด"

    q_0342 "ท่านได้รับ การปฏิบัติอย่างถูกต้องตามกฎหมายแรงงาน/พรบข้าราชการ 2551/พรบแรงงานรัฐวิสาหกิจสัมพันธ์ 2547/กฎหมายอื่นๆ จากองค์กรของท่าน หรือไม่", :pick => :one
    a_1 "ไม่ได้เลย/ได้รับน้อยที่สุด"
    a_2 "ได้รับเล็กน้อย"
    a_3 "ได้รับพอสมควร"
    a_4 "ได้รับมาก"
    a_5 "ได้รับมากที่สุด"

    q_0343 "ท่านได้รับการพิจารณาเลื่อนขั้น/ เลื่อนตำแหน่ง / ปรับขึ้นเงินค่าจ้างประจำปีที่ผ่นมาด้วยความเหมาะสมหรือไม่", :pick => :one
    a_1 "ไม่เหมาะสม/เหมาะสมน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0344 "ความถูกต้อง ของการจ่ายค่าจ้าง ค่าล่วงเวลา ฯลฯ ที่ท่านได้รับจากองค์กรของท่านเป็นอย่างไร", :pick => :one
    a_1 "ไม่ถูกต้องทุกครั้ง"
    a_2 "ไม่ถูกต้องบ่อยครั้ง"
    a_3 "ถูกต้องบางเป็นบางครั้ง"
    a_4 "ถูกต้องเกือบทุกครั้ง"
    a_5 "ถูกต้องทุกครั้ง"

    q_0345 "ความตรงเวลา ของการจ่ายค่าจ้าง ค่าล่วงเวลา ฯลฯ ที่ท่านได้รับจากองค์กรของท่านเป็นอย่างไร", :pick => :one
    a_1 "ไม่ตรงเวลาทุกครั้ง"
    a_2 "ไม่ตรงเวลาบ่อยครั้ง"
    a_3 "ตรงเวลาบ้างเป็นบางครั้ง"
    a_4 "ตรงเวลาเกือบทุกครั้ง"
    a_5 "ตรงเวลาทุกครั้ง"

    q_0346 "ค่าตอบแทนที่ท่านได้รับคุ้มค่ากับความเสี่ยงที่อาจเกิดจากการทำงาน (การถูกฟ้องร้อง/การได้รับอันตรายจากการทำงาน ฯลฯ)", :pick => :one
    a_1 "ไม่คุ้มค่า/คุ้มค่าน้อยที่สุด"
    a_2 "คุ้มค่าน้อย"
    a_3 "คุ้มค่าปานกลาง"
    a_4 "คุ้มค่ามาก"
    a_5 "คุ้มค่ามากที่สุด"

    q_0347 "ท่านได้รับการดูแลเกี่ยวกับสุขภาพที่ดีจากองค์กร หรือไม่", :pick => :one
    a_1 "ไม่ได้รับ/ได้รับน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0348 "ท่านพึงพอใจต่อสภาพแวดล้อมโดยรวมขององค์กร หรือไม่", :pick => :one
    a_1 "ไม่พอใจเลย/พอใจน้อยที่สุด"
    a_2 "พอใจน้อย"
    a_3 "พอใจปานกลาง"
    a_4 "พอใจมาก"
    a_5 "พอใจมากที่สุด"

    q_0349 "ท่านพึงพอใจกับสวัสดิการที่องค์กรจัดให้หรือไม่", :pick => :one
    a_1 "ไม่พอใจเลย/พอใจน้อยที่สุด"
    a_2 "พอใจน้อย"
    a_3 "พอใจปานกลาง"
    a_4 "พอใจมาก"
    a_5 "พอใจมากที่สุด"

    q_0350 "โดยรวมแล้วที่ทำงานของท่านให้ความสำคัญกับการทำงานเป็นทีมหรือไม่", :pick => :one
    a_1 "ไม่ให้/ให้น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0351 "โดยรวมแล้วความสัมพันธ์ในที่ทำงานของท่านเหมือนพี่เหมือนน้อง หรือไม่", :pick => :one
    a_1 "ไม่เหมือน/เหมือนน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0352 "โดยรวมแล้วท่านสื่อสารพูดคุยกับเพื่อนร่วมงานในที่ทำงานหรือไม่", :pick => :one
    a_1 "ไม่สื่อสารเลย/สื่อสารน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0353 "โดยรวมแล้วในที่ทำงานของท่านมีการถ่ายทอดแลกเปลี่ยนแบบอย่างการทำงานระหว่างกันหรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0354 "โดยรวมแล้วท่านทำงานอย่าง 'ความสุข' หรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0355 "ท่านจะแนะนำญาติ/เพื่อน/คนรู้จักมาทำงานที่องค์กรของท่านหรือไม่", :pick => :one
    a_1 "ไม่/แนะนำน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0356 "หากมีใครกล่าวถึงองค์กรในทางที่ไม่เหมาะสม ท่านจะปกป้ององค์กรของท่านหรือไม่", :pick => :one
    a_1 "ไม่/ปกป้องน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0357 "ท่านภาคภูมิใจที่ได้เป็นพนักงาน/บุคลากรขององค์กร/ได้ทำงานในองค์กรนี้หรือไม่", :pick => :one
    a_1 "ไม่ภาคภูมิใจ/ภูมิใจน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0358 "ขณะที่ทำงานอยู่ในองค์กรนี้ หากท่านมีโอกาสได้ศึกษาต่อและเมื่อสำเร็จการศึกษาแล้ว ท่านจะทำงานต่อหรือว่าลาออก", :pick => :one
    a_1 "ลาออกแน่นอน"
    a_2 "อาจจะลาออก"
    a_3 "น่าจะลาออก"
    a_4 "ไม่ลาออก"
    a_5 "ไม่ลาออกแน่นอน"

    q_0359 "ถ้าท่านมีโอกาสเปลี่ยนสถานที่ทำงาน หรือองค์กรอื่นชวน/ติดต่อไปทำงาน ท่านพร้อมที่จะไป หรือไม่", :pick => :one
    a_1 "ไปแน่นอน/ไปทันที"
    a_2 "คิดว่าจะไป"
    a_3 "ไม่แน่ใจ"
    a_4 "ไม่ไป"
    a_5 "ไม่ไปแน่นอน"

    q_0360 "ท่านรู้สึกเป็นเจ้าของร่วมขององค์กรที่ท่านทำงานในปัจจุบัน หรือไม่", :pick => :one
    a_1 "ไม่/ทุ่มเทน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0361 "ท่านทุ่มเททำงานเพื่อประโยชน์ขององค์การของท่านหรือไม่", :pick => :one
    a_1 "ไม่/ทุ่มเมน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0362 "ท่านเป็นคน คิดใหม่ ทำใหม่ เพื่อสร้างความก้าวหน้าให้กับองค์กรของท่านหรือไม่", :pick => :one
    a_1 "ไม่/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0363 "ในแต่ละวัน ท่านทำงานอย่างมีเป้าหมาย หรือไม่", :pick => :one
    a_1 "ไม่/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0364 "ท่านรู้สึกว่าโดยเฉลี่ยในหนึ่งสัปดาห์ท่านทำงานกี่วัน", :pick => :one
    a_1 "ทำงาน 1-2 วัน"
    a_2 "ทำงาน 3-4 วัน"
    a_3 "ทำงาน 5 วัน"
    a_4 "ทำงาน 6 วัน"
    a_5 "ทำงาน 7 วัน (ทุกวัน)"

    q_0365 "ท่านรู้สึกว่าโดยเฉลี่ยท่านทำงานวันละกี่ชั่วโมง", :pick => :one
    a_1 "น้อยกว่า 6 ชั่วโมง"
    a_2 "6-8 ชั่วโมง"
    a_3 "9-10 ชั่วโมง"
    a_4 "11-12 ชั่วโมง"
    a_5 "มากกว่า 12 ชั่วโมง"

    q_0366 "ท่านรู้สึกว่าได้พักผ่อนโดยเฉลี่ย (ไม่รวมการนอนหลับตอนกลางคืน) วันละกี่ชั่วโมง", :pick => :one
    a_1 "น้อยกว่า 1 ชั่วโมง"
    a_2 "1-2 ชั่วโมง"
    a_3 "3-5 ชั่วโมง"
    a_4 "6-7 ชั่วโมง"
    a_5 "8 ชั่วโมง"

    q_0367 "หน่วยงานของท่าน มีความยืดหยุ่น ในการทำงานหรือไม่ (เช่น ความยืดหยุ่นในการทำงานนอกสถานที่ ไม่ต้องเข้างาน/ออกงานตามเวลาที่กำหนด/สามารถเลือกวันหยุดของตนเองได้ ฯลฯ)", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0368 "ท่านทำงานตรงตามวุฒิการศึกษาหรือไม่", :pick => :one
    a_1 "ไม่ตรงตามวุฒิ/น้อยที่สุด"
    a_2 "น้อย"
    a_3 "ปานกลาง"
    a_4 "มาก"
    a_5 "มากที่สุด"

    q_0369 "ปัจจุบัน ความสุข ของท่านอยู่ในระดับใด โดยคะแนนจะเรียงจากน้อยไปหามาก เริ่มจาก 0 หมายถึง ไม่มีความสุขเลย ไปจนถึง 10 หมายถึงมีความสุขที่สุด", :pick => :one, :display_type => :slider
    (1..10).to_a.each{|num| a num.to_s}

  end
end


