# encoding: UTF-8
# Question#is_mandatory is now false by default. The default_mandatory option allows you to set
#   is_mandatory for all questions in a survey.

survey "HAPPINOMETER" do

  section "3 : Happinometer" do
  label "<font color='green' size='6'>Happy Body / สุขภาพกายดี</font>"

    group "ปัจจุบันท่าน", :display_type => :inline do
      q_03011 "น้ำหนัก"
      a "|กิโลกรัม", :integer

      q_03012 "ส่วนสูง"
      a "|เซนติเมตร", :integer

      q_03013 "เส้นรอบเอว"
      a "|นิ้ว", :integer
    end

    q_0302 "โดยปกติท่านกินอาหารเช้า โดยเฉลี่ยสัปดาห์ละกี่วัน", :pick => :one
    a_1 "ไม่กิน"
    a_2 "กินแต่ไม่บ่อย (1-2 วัน)"
    a_3 "กินเป็นบางครั้ง (3-4 วัน)"
    a_4 "กินเป็นประจำ (5-6 วัน)"
    a_5 "กินทุกวัน"

    q_0303 "ปัจจุบันท่านออกำลังกายโดยเฉลี่ยสัปดาห์ละกี่วัน", :pick => :one
    a_1 "ไม่ได้ออกกำลังกาย"
    a_2 "น้อยกว่า 3 วันต่อสัปดาห์"
    a_3 "จำนวน 3 วันต่อสัปดาห์"
    a_4 "มากกว่า 3 วันต่อสัปดาห์"
    a_5 "ทุกวัน"

    q_0304 "ปัจจุบันท่านสูบบุหรี่/ใบจาก/ยาเส้น หรือไม่", :pick => :one
    a_1 "สูบเป็นประจำ"
    a_2 "สูบบ่อยครั้ง"
    a_3 "สูบนานๆ ครั้ง"
    a_4 "ไม่สูบแต่เคยสูบ"
    a_5 "ไม่เคยดื่มเลย"

    q_0305 "ปัจจุบันท่านดื่มเครื่องดื่มแอลกอฮอล์ เช่น เหล้า เบียร์ ไวน์ สาโท หรือสุราพื้นบ้านหรือไม่", :pick => :one
    a_1 "ดื่มเกือบทุกวัน/เกือบทุกสัปดาห์"
    a_2 "ดื่มเกือบทุกเดือน"
    a_3 "ดื่มปีละ 1-2 ครั้ง"
    a_4 "ไม่ดื่มแต่เคยดื่ม"
    a_5 "ไม่เคยดื่มเลย"

  end
end

